"--------------------密码安全性检查--------------------"
temp = input('请输入需要检查的密码组合：')
secret = str(temp)
a = 0
b = 0
list1 = ['~','!','@','#','$','%','^','&','*','(',')','-','_','=',',','.','?','<','>','[',']','{','}','\\','|']

list2 = ['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y',
         'z','0','1','2','3','4','5','6','7','8','9','~','!','@','#','$','%','^','&','*','(',')','-','_','=',',',
         '.','?','<','>','[',']','{','}','\\','|']
len1 = len(secret)
#print('输入字符串长度：',len(secret))
for n in range(len(list1)):
    for m in range(len(secret)):
        if list1[n] == secret[m]:
            a = a + 1
#print('对比符号字符串个数：',a)

for i in range(len(list2)):
    for j in range(len(secret)):
        if list2[i] == secret[j]:
            b = b + 1
            #print('查看字符串：',secret[j])
#print('对比合法字符串个数：',b)

if b == len(secret):
    c = 1
else:
    c = 0
#print('两个字符串长度是否相等：',c)

if secret.isalnum():
    if 0 < len1 <= 8:
        print('您的密码安全级别判定位：低')
        print("""请按一下方式提升您的密码安全级别：
                        1、密码必须由数字、字母及特殊字符三种组合；
                        2、密码只能由字母开头；
                        3、密码长度不能低于16位；""")


if ( c == 1 ) and ( 0 < a <= 2 ):
    if 8 < len1 <= 16 :
        print('您的密码安全级别判定位：中')
        print("""请按一下方式提升您的密码安全级别：
                        1、密码必须由数字、字母及特殊字符三种组合；
                        2、密码只能由字母开头；
                        3、密码长度不能低于16位；""")


if ( c == 1 ) and ( a > 2 ):
    if len1 > 16:
        print('您的密码安全级别评定为：高')
        print('请继续保持')
    
